---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemOverride
source: html/6c2d8652-27a5-f38e-ddaf-568fe5162402.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemOverride Property

"Override Area Reinforcement Settings"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemOverride { get; }
```